def solution(letter):
    answer = ''
    # 모스부호의 딕셔너리
    morse = { 
        '.-':'a',
        '-...':'b',
        '-.-.':'c',
        '-..':'d',
        '.':'e',
        '..-.':'f',
        '--.':'g',
        '....':'h',
        '..':'i',
        '.---':'j',
        '-.-':'k',
        '.-..':'l',
        '--':'m',
        '-.':'n',
        '---':'o',
        '.--.':'p',
        '--.-':'q',
        '.-.':'r',
        '...':'s',
        '-':'t',
        '..-':'u',
        '...-':'v',
        '.--':'w',
        '-..-':'x',
        '-.--':'y',
        '--..':'z'
    }
    
    # 인자를 통해 받은 값들을 나누기(공백기준)
    for k in letter.split(" "):
        # 딕셔너리의 키와 값을 반복문을 통해 접근
        for i, j in morse.items():
            if k == i :
                answer += j
                
    return answer

print(solution('.... . .-.. .-.. ---'))
print(solution('.--. -.-- - .... --- -.'))